'''Есть интернет-магазин, у которого имеется приложение, десктопный и мобильный сайт.
Никаких других платформ у магазина нет. Одна из ключевых метрик — конверсия
в покупку из посещения магазина. По итогам года конверсия на десктопном сайте
выросла на 10%, на мобильном на 15%, а конверсия в приложении на 20% по сравнению
с прошлым годом.
Что мы можем сказать про общую конверсию магазина, если никакие новые платформы
магазин в этом году не запускал?

но вот какие мысли
1. конверсия ни как не может быть отрицательной - это количество покупок / на количество посещений
2. она выросла на 10, 16, 20% в зависимости от платформы, в целом
она выросла на 46% по всем платформам, а общая конверсия
это среднее от этих трех значений! Ответ 1!!!'''